huyhoang167/LAB1/Ex7,8,9,10/STM32/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define zero_Pin GPIO_PIN_4
#define zero_GPIO_Port GPIOA
#define one_Pin GPIO_PIN_5
#define one_GPIO_Port GPIOA
#define two_Pin GPIO_PIN_6
#define two_GPIO_Port GPIOA
#define three_Pin GPIO_PIN_7
#define three_GPIO_Port GPIOA
#define four_Pin GPIO_PIN_8
#define four_GPIO_Port GPIOA
#define five_Pin GPIO_PIN_9
#define five_GPIO_Port GPIOA
#define six_Pin GPIO_PIN_10
#define six_GPIO_Port GPIOA
#define seven_Pin GPIO_PIN_11
#define seven_GPIO_Port GPIOA
#define eight_Pin GPIO_PIN_12
#define eight_GPIO_Port GPIOA
#define nine_Pin GPIO_PIN_13
#define nine_GPIO_Port GPIOA
#define ten_Pin GPIO_PIN_14
#define ten_GPIO_Port GPIOA
#define eleven_Pin GPIO_PIN_15
#define eleven_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
